[
    {
        "plantId": 1,
        "plantName": "Snake Plant",
        "category": "Air Purifier",
        "price": 18,
        "rating": 4.8,
        "availableStock": 10,
        "careLevel": "Easy",
        "description": "The Snake Plant (Sansevieria trifasciata), also known as Mother-in-Law’s Tongue, is a striking and durable houseplant loved for its upright, sword-shaped leaves and unique green-yellow variegation. Originating from West Africa, it has become one of the most popular indoor plants worldwide due to its ability to thrive in almost any environment. The Snake Plant can survive in low light, dry air, and even neglect, making it perfect for both beginners and seasoned plant lovers. One of its greatest benefits is its air-purifying power — NASA’s Clean Air Study found that Snake Plants help remove harmful toxins such as formaldehyde, xylene, and benzene from indoor air. What makes it even more special is that it continues to produce oxygen at night, promoting better sleep and fresher air in bedrooms. The plant requires minimal care — just water sparingly every 2–3 weeks and ensure the soil drains well. It also tolerates both bright and low light conditions, so it fits easily into homes, offices, or shaded corners. With its elegant, architectural appearance, the Snake Plant adds a modern, stylish touch to any space.",
        "image": "https://www.gardenersdream.co.uk/cdn/shop/articles/Snake_Plant_1_f6204179-d92b-40e3-bec7-0d3a61e93b81.jpg?v=1744013002",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 2,
        "plantName": "Peace Lily",
        "category": "Indoor Plant",
        "price": 22,
        "rating": 4.7,
        "availableStock": 8,
        "careLevel": "Medium",
        "description": "The Peace Lily (Spathiphyllum wallisii) is one of the most elegant and easy-to-care-for indoor plants, cherished for its lush green leaves and beautiful white blooms that resemble calla lilies. Native to the tropical rainforests of Central and South America, this plant brings a calming, natural touch to any home or office environment. It thrives in low to medium light conditions, making it an excellent choice for shaded indoor spaces. Beyond its beauty, the Peace Lily is also an excellent air purifier, effectively removing toxins such as ammonia, formaldehyde, and benzene from indoor air. It helps improve air quality while maintaining humidity — beneficial for people with dry skin or allergies. Peace Lilies prefer moist but well-drained soil and typically need watering once a week. When it needs water, its leaves slightly droop, acting as a natural reminder. Symbolically, the Peace Lily represents purity, peace, and healing, which is why it’s often given as a gift during times of sympathy or renewal. With minimal maintenance and stunning appearance, the Peace Lily is a timeless symbol of tranquility and freshness in any living space.",
        "image": "https://prickleplants.co.uk/cdn/shop/products/b95a32ed-5207-4a85-ad06-2f06b67cd046.jpg?v=1661164123",
        "providerName": "Leaf & Light"
    },
    {
        "plantId": 3,
        "plantName": "Aloe Vera",
        "category": "Medicinal",
        "price": 15,
        "rating": 4.6,
        "availableStock": 12,
        "careLevel": "Easy",
        "description": "Aloe Vera is a popular succulent plant known for its thick, fleshy leaves filled with a soothing gel that offers numerous health and skincare benefits. Native to arid regions of Africa and the Arabian Peninsula, Aloe Vera has been used for centuries for its healing, moisturizing, and anti-inflammatory properties. Its gel is widely used to treat burns, wounds, and dry skin, while the plant itself helps purify the air and adds a touch of fresh greenery to any room. Aloe Vera thrives in bright, indirect sunlight and requires very little water, making it an ideal plant for busy individuals or beginners. It stores water in its leaves, allowing it to survive long dry periods with ease. This hardy, low-maintenance plant symbolizes healing, resilience, and natural beauty, making it a perfect addition to both homes and offices seeking a touch of life and wellness.",
        "image": "https://m.media-amazon.com/images/I/71vDeWZkH8L._AC_UF350,350_QL80_.jpg",
        "providerName": "Green Corner BD"
    },
    {
        "plantId": 4,
        "plantName": "Fiddle Leaf Fig",
        "category": "Decorative",
        "price": 30,
        "rating": 4.9,
        "availableStock": 6,
        "careLevel": "Hard",
        "description": "The Fiddle Leaf Fig (Ficus lyrata) is a stunning indoor plant known for its large, violin-shaped leaves and bold architectural presence. Native to West Africa, it has become a favorite for interior designers and plant enthusiasts seeking a dramatic statement piece. The Fiddle Leaf Fig thrives in bright, indirect sunlight and requires moderate watering, allowing the soil to dry slightly between waterings. While it demands a little care and attention, the visual impact it brings to any room is unmatched. Its glossy, broad leaves not only add a sense of elegance and height but also contribute to indoor air purification. Ideal for living rooms, offices, and creative spaces, the Fiddle Leaf Fig combines style, sophistication, and natural beauty. With proper care, this plant can grow into a magnificent centerpiece, bringing greenery and life to your indoor environment.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcScv9d014xu6yWlNPESKnPUj785UgG5IkxvHw&s",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 5,
        "plantName": "Spider Plant",
        "category": "Air Purifier",
        "price": 14,
        "rating": 4.5,
        "availableStock": 15,
        "careLevel": "Easy",
        "description": "The Spider Plant (Chlorophytum comosum) is a popular indoor plant cherished for its long, arching green leaves with white stripes and its easy-going nature. Native to South Africa, it is highly adaptable and thrives in a variety of indoor conditions, making it perfect for beginners. Spider Plants are excellent natural air purifiers, capable of removing toxins like formaldehyde and xylene from the air, while also helping to maintain indoor humidity. They grow rapidly and produce baby plantlets, often called 'spiderettes,' which can be propagated easily to grow new plants. The plant prefers bright, indirect sunlight but can tolerate lower light conditions, and it requires moderate watering, allowing the soil to dry slightly between waterings. With minimal maintenance, resilience, and aesthetic appeal, the Spider Plant adds freshness, greenery, and a sense of vitality to homes and offices, making it a timeless favorite among indoor plants.",
        "image": "https://www.thetutuguru.com.au/wp-content/uploads/2024/04/Chlorophytum-comosum-Spider-Plant-potted.jpg",
        "providerName": "Nature Nest"
    },
    {
        "plantId": 6,
        "plantName": "Money Plant",
        "category": "Lucky Plant",
        "price": 16,
        "rating": 4.7,
        "availableStock": 9,
        "careLevel": "Easy",
        "description": "The Money Plant (Epipremnum aureum), also known as Devil’s Ivy or Golden Pothos, is a popular indoor plant believed to bring good luck, prosperity, and positive energy. Native to Southeast Asia, this vine-like plant is easy to grow and maintain, thriving in indirect sunlight and moderate watering. Its vibrant green leaves and trailing stems make it a beautiful decorative addition to homes, offices, and indoor gardens. Money Plants can be grown in soil or water, making them versatile for various indoor setups. Besides its symbolic value, it also contributes to purifying the air by removing toxins and maintaining a fresh environment. With minimal care, rapid growth, and aesthetic appeal, the Money Plant is both an attractive and meaningful indoor plant that adds beauty, greenery, and positive vibes to any space.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLvOb9nbjjn_6duDpzshP84OTZnz9FWuofbg&s",
        "providerName": "GreenGlow Nursery"
    },
    {
        "plantId": 7,
        "plantName": "Rubber Plant",
        "category": "Indoor Plant",
        "price": 25,
        "rating": 4.6,
        "availableStock": 7,
        "careLevel": "Medium",
        "description": "The Rubber Plant (Ficus elastica) is a popular indoor plant known for its large, glossy, dark green leaves that add a touch of elegance and modern style to any space. Native to Southeast Asia, it thrives in bright, indirect light but can also adapt to lower light conditions. Rubber Plants are easy to care for, requiring moderate watering and well-draining soil, making them suitable for both beginners and experienced plant enthusiasts. In addition to their visual appeal, Rubber Plants help improve indoor air quality by removing toxins and increasing oxygen levels. They can grow into tall, impressive trees indoors, adding architectural beauty to living rooms, offices, and indoor gardens. With proper care, the Rubber Plant is a long-lasting, resilient, and stylish addition that brings greenery, freshness, and a calming atmosphere to any indoor environment.",
        "image": "https://www.thesill.com/cdn/shop/files/the-sill_ficus_elastica_upcycled-planter_small_cream_1.jpg?v=1753648341&width=1946",
        "providerName": "Leaf & Light"
    },
    {
        "plantId": 8,
        "plantName": "Areca Palm",
        "category": "Air Purifier",
        "price": 28,
        "rating": 4.8,
        "availableStock": 11,
        "careLevel": "Medium",
        "description": "The Areca Palm (Dypsis lutescens), also known as Butterfly Palm or Golden Cane Palm, is a graceful indoor plant admired for its feathery, arching fronds and vibrant green color. Native to Madagascar, it is highly popular for homes and offices due to its air-purifying qualities and elegant appearance. Areca Palms thrive in bright, indirect sunlight and prefer moderately moist, well-drained soil. They are low-maintenance, adding a tropical, lush aesthetic to living rooms, hallways, and workspaces. Besides its visual appeal, the Areca Palm helps improve indoor air quality by removing toxins and increasing humidity, making the indoor environment healthier. With proper care, this plant can grow tall and striking, bringing life, freshness, and a serene, tropical vibe to any interior space. Its combination of beauty, resilience, and air-purifying benefits makes the Areca Palm a favorite choice for indoor greenery enthusiasts.",
        "image": "https://cdn.shopify.com/s/files/1/0553/5711/2435/files/Areca-Palm-plant_480x480.jpg?v=1722232962",
        "providerName": "Nature Nest"
    },
    {
        "plantId": 9,
        "plantName": "Boston Fern",
        "category": "Hanging Plant",
        "price": 20,
        "rating": 4.4,
        "availableStock": 13,
        "careLevel": "Medium",
        "description": "The Boston Fern (Nephrolepis exaltata) is a classic indoor plant known for its lush, arching fronds and vibrant green foliage, making it an elegant addition to any home or office. Native to tropical regions, it thrives in indirect sunlight and high humidity, making it ideal for bathrooms, living rooms, and shaded indoor areas. Boston Ferns are excellent natural air purifiers, helping remove indoor toxins while maintaining moisture levels in the air. They prefer consistently moist, well-drained soil and regular misting to keep their fronds healthy and vibrant. With its cascading leaves and rich greenery, the Boston Fern adds a sense of freshness, tranquility, and natural beauty to interior spaces. Its combination of decorative appeal, air-purifying qualities, and easy adaptability makes it a timeless favorite for indoor gardening enthusiasts.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSi-ynAUFEdFDIMpDdPsIj7uPJ1tuooiCgbnw&s",
        "providerName": "Green Corner BD"
    }
]